Tekla Open API Reference for Tekla Structures 2025
View.ViewMarkSymbolAttributes Constructor (Double, MarkSymbolShape, View.LabelLineLengthType, Double)
 Creates a new mark symbol attributes instance with the given size, shape, line length type and line length.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ViewMarkSymbolAttributes(
	double size,
	MarkSymbolShape shape,
	View.LabelLineLengthType lineLengthType,
	double lineLength
)
Public Sub New (
	size As Double,
	shape As MarkSymbolShape,
	lineLengthType As View.LabelLineLengthType,
	lineLength As Double
)
Parameters
size
Type: System.Double
The size of the mark symbol to be used.
shape
Type: Tekla.Structures.Drawing.MarkSymbolShape
The shape of the mark symbol to be used.
lineLengthType
Type: Tekla.Structures.Drawing.View.LabelLineLengthType
The line length type of the mark symbol to be used.
lineLength
Type: System.Double
The line length of the mark symbol to be used.
See Also
Reference
View.ViewMarkSymbolAttributes Class
View.ViewMarkSymbolAttributes Overload
Tekla.Structures.Drawing Namespace